In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'id':range(15), 'chars':['ab']*15})

In [3]:
df

    id chars
0    0    ab
1    1    ab
2    2    ab
3    3    ab
4    4    ab
5    5    ab
6    6    ab
7    7    ab
8    8    ab
9    9    ab
10  10    ab
11  11    ab
12  12    ab
13  13    ab
14  14    ab

In [16]:
df = pd.read_excel('/Users/zaha/Documents/shop_list.xls', header=0, sep= '\t')

In [17]:
df

       Name shop  Data_start       City          Format  SKU_Count
0  Стремительный  12.03.2000    Москва              NaN       1300
1    Хрустальный  07.08.1999  Волгоград  Магазин у дома       1000
2     Турбуленый  13.02.2000  Краснодар     Гипермаркет       3000
3        Опасный  15.04.2005  Краснодар             NaN       1300
4        Полдний  19.11.2005     Москва  Магазин у дома       1000
5   Колоссальный  31.05.2005     Москва       Косметика       1500
6       Правивый       38105     Москва             NaN       1300

In [19]:
9df.columns

Index(['Name shop', 'Data_start', 'City', 'Format', 'SKU_Count'], dtype='object')

In [20]:
df.shape

(7, 5)

In [22]:
df.dtypes

Name shop     object
Data_start    object
City          object
Format        object
SKU_Count      int64
dtype: object

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
Name shop     7 non-null object
Data_start    7 non-null object
City          7 non-null object
Format        4 non-null object
SKU_Count     7 non-null int64
dtypes: int64(1), object(4)
memory usage: 360.0+ bytes

In [27]:
df.describe()

         SKU_Count
count     7.000000
mean   1485.714286
std     691.444313
min    1000.000000
25%    1150.000000
50%    1300.000000
75%    1400.000000
max    3000.000000